# Создайте несколько переменных разных типов.
# Проверьте к какому типу относятся созданные переменные.


num_int = 3
num_float = 3.0
str_var = 'string'
bool_var = True
cortage = (1, 2)
array = [1, 2]


print(f'Переменная num_int = {num_int}, тип {type(num_int)}')
print(f'Переменная num_float = {num_float}, тип {type(num_float)}')
print(f'Переменная str_var = {str_var}, тип {type(str_var)}')
print(f'Переменная bool_var = {bool_var}, тип {type(bool_var)}')
print(f'Переменная cortage = {cortage}, тип {type(cortage)}')
print(f'Переменная array = {array}, тип {type(array)}')